tutorials/jet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

kInlet          1e-2;

internalField   uniform $kInlet;

boundaryField
{
//    #includeEtc "caseDicts/setConstraintTypes"

    Inlet1
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 0.01;
    }
    Inlet2
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }

    wedge1{type wedge;}
    wedge2{type wedge;}
}


// ************************************************************************* //
